# Import Libraries

In [1]:
# Load libraries
import numpy as np
from matplotlib import pyplot
from pandas import read_csv 
from pandas import set_option
set_option('display.max_rows', 500)
set_option('display.max_columns', 500)
import pandas as pd
import matplotlib.pyplot as plt
from datetime import datetime
import pyodbc
from pandas.plotting import scatter_matrix
import seaborn as sns
import warnings
warnings.filterwarnings("ignore")

# Connect to SQL Server

In [2]:
pyodbc.drivers()

['SQL Server', 'ODBC Driver 17 for SQL Server']

In [3]:
connection = pyodbc.connect(
"Driver={ODBC Driver 17 for SQL Server};"
"Server=DESKTOP-ROTIMI\SQLEXPRESS;"
"Database=LMS;"
"Trusted_Connection=yes;")

# load dataset

#### Extracting data from SQL Server

In [4]:
# View data from SQL Server
Book_Issue = pd.read_sql("Select * from [dbo].[LMS_BOOK_ISSUE]",connection)

Analyze Data

# Book_Issue Table

#### View Data

In [5]:
# head
Book_Issue.head()

,BOOK_ISSUE_NO,MEMBER_ID,BOOK_CODE,DATE_ISSUE,DATE_RETURN,DATE_RETURNED,FINE_RANGE
0,1,LM001,BL000001,2012-05-01,2012-05-16,2012-05-16,None
1,2,LM002,BL000002,2012-05-01,2012-05-06,2012-05-16,R2
2,3,LM003,BL000007,2012-04-01,2012-04-16,2012-04-20,R1
3,4,LM004,BL000005,2012-04-01,2012-04-16,2012-04-20,R1
4,5,LM005,BL000005,2012-04-20,2012-05-05,2012-05-05,None

#### shape of the data

In [6]:
# shape
print(Book_Issue.shape)

(24, 7)

In [7]:
# Basic info
print(Book_Issue.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24 entries, 0 to 23
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   BOOK_ISSUE_NO  24 non-null     int64
 1   MEMBER_ID      24 non-null     object
 2   BOOK_CODE      24 non-null     object
 3   DATE_ISSUE     24 non-null     object
 4   DATE_RETURN    24 non-null     object
 5   DATE_RETURNED  24 non-null     object
 6   FINE_RANGE     16 non-null     object
dtypes: int64(1), object(6)
memory usage: 1.4+ KB
None

#### types of the data column

In [8]:
# types
print(Book_Issue.dtypes)

BOOK_ISSUE_NO     int64
MEMBER_ID        object
BOOK_CODE        object
DATE_ISSUE       object
DATE_RETURN      object
DATE_RETURNED    object
FINE_RANGE       object
dtype: object

#### data descriptions

In [9]:
# Summary statistics (numerical columns)
Book_Issue.describe()

       BOOK_ISSUE_NO
count      24.000000
mean       12.500000
std         7.071068
min         1.000000
25%         6.750000
50%        12.500000
75%        18.250000
max        24.000000

#### data descriptions

In [10]:
# descriptions
Book_Issue.describe(include = 'object')

       MEMBER_ID BOOK_CODE  DATE_ISSUE DATE_RETURN DATE_RETURNED FINE_RANGE
count         24        24          24          24            24         16
unique         5         4          18          20            16          3
top        LM003  BL000001  2012-05-01  2012-04-16    2012-05-16         R1
freq           8         6           2           2             2          8

#### Check for missing entries

In [11]:
# Check for missing entries
total = Book_Issue.isnull().sum().sort_values(ascending=False)
percent=(Book_Issue.isnull().sum()*100/len(Book_Issue)).sort_values(ascending=False)
missing_data = pd.concat([total, percent], axis=1,keys=['Total', 'Percent'])
missing_data.head(20)

               Total    Percent
FINE_RANGE         8  33.333333
BOOK_ISSUE_NO      0   0.000000
MEMBER_ID          0   0.000000
BOOK_CODE          0   0.000000
DATE_ISSUE         0   0.000000
DATE_RETURN        0   0.000000
DATE_RETURNED      0   0.000000

In [12]:
Book_Issue['FINE_RANGE'].value_counts(dropna = False)

FINE_RANGE
None    8
R1      8
R2      4
R4      4
Name: count, dtype: int64

In [13]:
Book_Issue['FINE_RANGE'].fillna('R0',inplace =True)

#### Check for duplicate data

In [14]:
# locate rows of duplicate data

# calculate duplicates
dups = Book_Issue.duplicated()
# report if there are any duplicates
print(dups.any())

False

In [15]:
# Convert to datetime
Book_Issue['DATE_ISSUE'] = pd.to_datetime(Book_Issue['DATE_ISSUE'])
Book_Issue['DATE_RETURN'] = pd.to_datetime(Book_Issue['DATE_RETURN'])
Book_Issue['DATE_RETURNED'] = pd.to_datetime(Book_Issue['DATE_RETURNED'])

# Analysis

In [16]:
# List Of Top MEMBER_ID
Book_Issue['MEMBER_ID'].value_counts()

MEMBER_ID
LM003    8
LM001    4
LM002    4
LM004    4
LM005    4
Name: count, dtype: int64

In [17]:
# List Top BOOK_CODE 
Book_Issue['BOOK_CODE'].value_counts()

BOOK_CODE
BL000001    6
BL000002    6
BL000007    6
BL000005    6
Name: count, dtype: int64

In [18]:
# Export Book_Issue data to CSV without index
Book_Issue.to_csv("Book_Issue.csv",index =False)

## ðŸ’¬ Contact

Feel free to connect with me on:
- GitHub: [https://github.com/rotimi2020]
- LinkedIn: [https://www.linkedin.com/in/rotimi-sheriff-omosewo-939a806b/]
- Email: [omoseworotimi@gmail.com]